{
    "Welcome": "Bienvenue",
    "name": "Je suis Abdulrahman Akhras",
    "position": "Développeur Fullstack",
    "where": "De Nimègue, NL.",
    "what i do": "Je crée des sites web personnalisés pour aider les entreprises à mieux réussir en ligne.",
    "aboutme1LineOne":"Je suis Développeur Frontend professionnel     ",
    "aboutme1LineTwo":"vivant à Nimègue avec deux ans d'expérience en ",
    "aboutme1LineThree":"React et Vue. Je me spécialise dans la création",
    "aboutme1LineFour":"d'applications modernes et réactives, axées sur",
    "aboutme1LineFive":"des solutions conviviales et évolutives.       ",
    "aboutme1LineSix":"J'ai de solides compétences en méthodologies  ",
    "aboutme1LineSeven":"Agiles et outils de développement modernes.    ",
    "aboutme2LineOne": "J'ai aussi quatre ans d'expérience en  ingénierie        ",
    "aboutme2LineTwo": "électrique (EPLAN P8) et un diplôme de licence ",
    "aboutme2LineThree": "en génie électrique. Mon bagage  technique   ",
    "aboutme2LineFour": "améliore mes compétences en résolution.",

    "Project": {
    "ProjectOne": {
      "Overview": [
        "Développé une application web interactive conçue pour présenter les services et solutions numériques d'une entreprise de manière visuellement attrayante.",
        "L'application offre une expérience utilisateur fluide avec une navigation personnalisée et des éléments interactifs, mettant en avant divers défis commerciaux et leurs solutions correspondantes."
      ],
      "Features": [
        "Navigation personnalisée avec des transitions fluides et une interface utilisateur intuitive.",
        "Éléments interactifs tels que des animations, des effets au survol et du contenu dynamique.",
        "Sections de présentation des solutions qui exposent clairement les défis commerciaux et les solutions."
      ],
      "TechnologiesUsed": [
        "React",
        "TypeScript",
        "React Router",
        "HTML/CSS",
        "Vite",
        "Tailwind CSS",
        "Netlify",
        "Swiper",
        "Framer Motion"
      ]
    },
    "ProjectTwo": {
      "Overview": [
        "Développé une application web complète pour un commerce de lunettes, mettant l'accent sur la présentation et la gestion des produits de lunettes de soleil.",
        "L'application inclut des fonctionnalités pour parcourir les produits, consulter des informations détaillées sur les produits et gérer un panier d'achat.",
        "Intégration de Stripe pour un traitement des paiements sécurisé et efficace, permettant aux utilisateurs de compléter leurs achats en douceur.",
        "Utilisation d'une API externe pour vérifier et utiliser la localisation des utilisateurs afin d'améliorer la fonctionnalité, comme l'affichage des emplacements des magasins ou des promotions locales.",
        "Mise en œuvre d'un système d'authentification des utilisateurs pour permettre aux clients de créer des comptes, de se connecter et de suivre leurs commandes.",
        "Incorporation de principes de design réactif pour garantir une expérience utilisateur fluide sur divers appareils.",
        "Utilisation d'une pile technologique moderne pour offrir une expérience d'achat fluide et efficace, y compris des mises à jour en temps réel et des éléments interactifs."
      ],
      "Features": [
        "Catalogue de produits avec informations détaillées et images de haute qualité.",
        "Fonctionnalité de panier d'achat avec mises à jour en temps réel et processus de paiement.",
        "Traitement des paiements sécurisé intégré avec Stripe.",
        "Intégration d'une API externe pour vérifier la localisation des utilisateurs et fournir des services localisés.",
        "Système d'authentification des utilisateurs pour la gestion des comptes et le suivi des commandes.",
        "Design réactif garantissant la compatibilité sur les ordinateurs de bureau, les tablettes et les smartphones.",
        "Éléments interactifs pour améliorer l'engagement des utilisateurs et la découverte des produits."
      ],
      "TechnologiesUsed": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "HTML/CSS",
        "JavaScript",
        "Bootstrap",
        "Material-UI",
        "Redux",
        "React Router",
        "Axios",
        "Stripe",
        "API externe pour les services de localisation"
      ]
    },
    "ProjectThree": {
      "Overview": [
        "Développé un système backend pour la gestion des utilisateurs et l'authentification, utilisant des technologies modernes pour fournir des fonctionnalités sécurisées et efficaces.",
        "Le système inclut l'inscription des utilisateurs, la vérification par email et des mécanismes de connexion sécurisés utilisant JSON Web Tokens (JWT).",
        "Intégration des capacités de téléchargement de fichiers avec Multer et rendu dynamique des vues avec EJS.",
        "Mise en œuvre de notifications par email via Nodemailer pour les actions transactionnelles.",
        "Utilisation de SWA (Static Web Apps) pour un déploiement et un hébergement des fichiers sans faille.",
        "L'application prend en charge la gestion des profils utilisateurs et la gestion sécurisée des sessions."
      ],
      "Features": [
        "Inscription des utilisateurs avec vérification par email et authentification sécurisée.",
        "Authentification basée sur JWT pour des sessions utilisateur sécurisées et sans état.",
        "Fonctionnalité de téléchargement de fichiers avec Multer pour gérer le contenu généré par les utilisateurs.",
        "Rendu dynamique des vues avec EJS pour des expériences utilisateur personnalisées.",
        "Notifications par email transactionnelles via Nodemailer pour des actions telles que l'inscription et la vérification.",
        "Déploiement et hébergement des fichiers efficaces en utilisant SWA."
      ],
      "TechnologiesUsed": [
        "Node.js",
        "Express.js",
        "MongoDB",
        "JSON Web Tokens (JWT)",
        "Multer (pour les téléchargements de fichiers)",
        "EJS (pour le rendu des vues)",
        "Nodemailer (pour l'envoi des emails transactionnels)",
        "SWA (Static Web Apps)"
      ]
    },
    "ProjectFour": {
      "Overview": [
        "Développé une application Todo polyvalente pour aider les utilisateurs à gérer efficacement leurs tâches.",
        "L'application inclut des fonctionnalités pour ajouter, modifier et supprimer des tâches, ainsi que pour les marquer comme terminées.",
        "Incorporation d'une authentification utilisateur pour permettre aux utilisateurs de créer des comptes et de sauvegarder leurs tâches en toute sécurité.",
        "Implémentation de mises à jour en temps réel pour s'assurer que les modifications des tâches sont reflétées immédiatement dans l'interface utilisateur.",
        "Optimisé pour la réactivité afin de garantir une expérience fluide sur divers appareils."
      ],
      "Features": [
        "Gestion des tâches avec des options pour ajouter, modifier, supprimer et marquer les tâches comme terminées.",
        "Système d'authentification des utilisateurs pour la création de comptes et la gestion des tâches.",
        "Mises à jour en temps réel pour refléter instantanément les changements dans les tâches.",
        "Design réactif pour une expérience cohérente sur différentes tailles d'écran.",
        "Interface utilisateur claire et intuitive pour une gestion facile des tâches."
      ],
      "TechnologiesUsed": [
        "React",
        "Node.js",
        "HTML/CSS",
        "JavaScript",
        "Bootstrap",
        "Material-UI",
        "Axios"
      ]
    }
  },
    "EDUsection": {
      "title": "ÉDUCATION ET FORMATION",
      "firstPart": {
        "title": "LICENCE EN GÉNIE ÉLECTRIQUE",
        "description": "Diplômé de l'Université de Technologie en 2017 avec une Licence en Génie Électrique.",
        "docs": []
      },
      "secondPart": {
        "title": "CERTIFICAT EN TECHNIQUES INFORMATIQUES"
      }
    },
    "WEsection": {
      "title": "EXPÉRIENCE PROFESSIONNELLE",
      "firstPart": {
        "title": "DÉVELOPPEUR LOGICIEL",
        "companyName": "CODE MATRIX ZONE",
        "period": "6/12/2022 – ACTUEL Rotterdam, Pays-Bas",
        "description": "En tant que développeur logiciel, je suis responsable de la conception, du développement et de la maintenance d'applications logicielles adaptées aux exigences spécifiques de chaque projet. Je me concentre sur l'écriture de code propre, efficace et testable tout en respectant les normes de l'industrie. En plus du développement, je m'assure que les applications logicielles sont fiables et performantes en effectuant un débogage minutieux et en résolvant les problèmes, en appliquant des méthodologies de test rigoureuses pour identifier et corriger les défauts. Je collabore largement avec les chefs de projet, les concepteurs et les autres développeurs pour garantir une intégration transparente et une cohérence avec les objectifs du projet. Grâce à une communication claire, je tiens toutes les parties prenantes informées des progrès, des défis et des solutions, en veillant à ce que les projets respectent les délais. Engagé à rester à la pointe de l'industrie technologique, j'élargis continuellement mes connaissances sur les nouveaux langages de programmation, outils et technologies. J'applique ces apprentissages pour affiner mes processus de développement et améliorer la qualité des logiciels que je livre, en respectant toujours les meilleures pratiques pour garantir que chaque solution que je fournis est à la fois évolutive et durable."
      }
    },
    "WEsection1": {
      "title": "EXPÉRIENCE PROFESSIONNELLE EN TANT QU'INGÉNIEUR ÉLECTRICIEN",
      "firstPart": {
        "title": "INGÉNIEUR ÉLECTRICIEN",
        "companyName": "ARSANMAK MAKINA",
        "period": "05/01/2018 – 01/09/2019 Istanbul, Turquie",
        "description": "En tant qu'Ingénieur Électricien chez Arsanmak Makina, j'ai conçu des schémas électriques détaillés et des plans pour des machines automatiques de remplissage et de capsulage à l'aide d'EPLA. En collaborant étroitement avec les clients, les ingénieurs et les membres de l'équipe, j'ai veillé à ce que les exigences du projet soient respectées et que les problèmes techniques soient résolus efficacement. J'ai également documenté les progrès des projets, analysé les données et préparé des rapports détaillés sur les études électriques. De plus, j'ai élaboré des spécifications pour l'achat de composants et de matériaux électriques, garantissant leur conformité aux besoins et normes des projets."
      },
      "secondPart": {
        "title": "INGÉNIEUR ÉLECTRICIEN",
        "companyName": "ALSHEHABIE",
        "period": "15/06/2016 – 01/09/2017 Tartous, Syrie",
        "description": "En tant qu'Ingénieur Électricien chez Alshehabie, j'ai conçu des schémas PLC détaillés pour le relais et la protection des systèmes, garantissant le fonctionnement sûr et fiable des systèmes électriques. J'ai développé et géré la partie conception électrique des plannings de projets, coordonné les tâches pour respecter les délais et aligné les plannings sur les projets globaux. En appliquant les meilleures pratiques de l'industrie, j'ai garanti des conceptions électriques optimales et encouragé les améliorations continues des processus, contribuant à l'efficacité et à la qualité des projets."
      }
    }
  
  
  }
  