{
    "Welcome": "مرحبًا",
    "name": "أنا عبدالرحمن أخرس",
    "position": "مطور Fullstack",
    "where": "من نيميخن، هولندا.",
    "what i do": "أنشئ مواقع ويب مخصصة لمساعدة الشركات على تحسين أدائها عبر الإنترنت.",
    "aboutme1LineOne":"أنا مطور واجهات أمامية محترف أعيش في نيميجن   ",
    "aboutme1LineTwo":"مع خبرة سنتين في React و Vue. متخصص في بناء   ",
    "aboutme1LineThree":"تطبيقات حديثة ومتجاوبة، مع التركيز على تقديم ",
    "aboutme1LineFour":"حلول سهلة الاستخدام وقابلة للتطوير.          ",
    "aboutme1LineFive":"أمتلك مهارات قوية في منهجيات أجايل الحديثة  ",
    "aboutme1LineSix":"واستخدام أدوات التطوير الحديثة.              ",
    "aboutme1LineSeven":"                                             ",
    "aboutme2LineOne": "لدي أيضًا أربع سنوات من الخبرة في الهندسة    ",
    "aboutme2LineTwo": "الكهربائية (EPLAN P8) وشهادة بكالوريوس في    ",
    "aboutme2LineThree": "الهندسة الكهربائية. خلفيتي التقنية تعزز من   ",
    "aboutme2LineFour": "قدراتي في حل المشاكل.                        "
    ,
    "Project": {
    "ProjectOne": {
      "Overview": [
        "تم تطوير تطبيق ويب تفاعلي مصمم لعرض خدمات وحلول الشركة الرقمية بطريقة جذابة بصريًا.",
        "يوفر التطبيق تجربة مستخدم سلسة مع تنقل مخصص وعناصر تفاعلية، ويعرض التحديات التجارية المختلفة وحلولها المقابلة."
      ],
      "Features": [
        "تنقل مخصص مع انتقالات سلسة وواجهة مستخدم بديهية.",
        "عناصر تفاعلية مثل الرسوم المتحركة وتأثيرات التمرير والمحتوى الديناميكي.",
        "أقسام عرض الحلول التي تعرض بوضوح التحديات التجارية والحلول."
      ],
      "TechnologiesUsed": [
        "React",
        "TypeScript",
        "React Router",
        "HTML/CSS",
        "Vite",
        "Tailwind CSS",
        "Netlify",
        "Swiper",
        "Framer Motion"
      ]
    },
    "ProjectTwo": {
      "Overview": [
        "تم تطوير تطبيق ويب شامل لتجارة النظارات، مع التركيز على عرض وإدارة منتجات النظارات الشمسية.",
        "يتضمن التطبيق ميزات لتصفح المنتجات، عرض معلومات مفصلة عن المنتجات، وإدارة عربة التسوق.",
        "تم دمج Stripe لمعالجة المدفوعات بشكل آمن وفعال، مما يسمح للمستخدمين بإكمال عمليات الشراء بسلاسة.",
        "تم استخدام واجهة برمجة التطبيقات الخارجية للتحقق من موقع المستخدمين واستخدامه لتحسين الوظائف، مثل عرض مواقع المتاجر أو العروض المحلية.",
        "تنفيذ نظام المصادقة للمستخدمين للسماح للعملاء بإنشاء حسابات، تسجيل الدخول، وتتبع طلباتهم.",
        "تطبيق مبادئ التصميم المتجاوب لضمان تجربة مستخدم سلسة عبر أجهزة مختلفة.",
        "استخدام مجموعة تكنولوجية حديثة لتقديم تجربة تسوق سلسة وفعالة، بما في ذلك التحديثات في الوقت الفعلي والعناصر التفاعلية."
      ],
      "Features": [
        "كتالوج المنتجات بمعلومات مفصلة وصور عالية الجودة.",
        "وظيفة عربة التسوق مع التحديثات في الوقت الفعلي وعملية الدفع.",
        "معالجة المدفوعات بشكل آمن مدمجة مع Stripe.",
        "تكامل واجهة برمجة التطبيقات الخارجية للتحقق من موقع المستخدمين وتقديم خدمات محلية.",
        "نظام المصادقة للمستخدمين لإدارة الحسابات وتتبع الطلبات.",
        "تصميم متجاوب لضمان التوافق عبر أجهزة الكمبيوتر المكتبية والأجهزة اللوحية والهواتف الذكية.",
        "عناصر تفاعلية لتعزيز تفاعل المستخدم واكتشاف المنتجات."
      ],
      "TechnologiesUsed": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "HTML/CSS",
        "JavaScript",
        "Bootstrap",
        "Material-UI",
        "Redux",
        "React Router",
        "Axios",
        "Stripe",
        "واجهة برمجة التطبيقات الخارجية لخدمات الموقع"
      ]
    },
    "ProjectThree": {
      "Overview": [
        "تم تطوير نظام خلفي لإدارة المستخدمين والمصادقة، باستخدام تقنيات حديثة لتوفير وظائف آمنة وفعالة.",
        "يتضمن النظام تسجيل المستخدمين، التحقق عبر البريد الإلكتروني، وآليات تسجيل الدخول الآمنة باستخدام JSON Web Tokens (JWT).",
        "دمج قدرات تحميل الملفات باستخدام Multer وعرض المشاهد الديناميكي باستخدام EJS.",
        "تنفيذ إشعارات البريد الإلكتروني باستخدام Nodemailer لأغراض المعاملات.",
        "استخدام SWA (تطبيقات الويب الثابتة) لنشر الملفات واستضافتها بسلاسة.",
        "يدعم التطبيق إدارة ملفات المستخدمين وإدارة الجلسات بشكل آمن."
      ],
      "Features": [
        "تسجيل المستخدمين مع التحقق عبر البريد الإلكتروني والمصادقة الآمنة.",
        "المصادقة المستندة إلى JWT لجلسات مستخدم آمنة وغير حالة.",
        "وظيفة تحميل الملفات باستخدام Multer للتعامل مع المحتوى الذي ينشئه المستخدمون.",
        "عرض المشاهد الديناميكي باستخدام EJS لتجارب مستخدم مخصصة.",
        "إشعارات بريد إلكتروني معاملية عبر Nodemailer للإجراءات مثل التسجيل والتحقق.",
        "نشر الملفات واستضافتها بكفاءة باستخدام SWA."
      ],
      "TechnologiesUsed": [
        "Node.js",
        "Express.js",
        "MongoDB",
        "JSON Web Tokens (JWT)",
        "Multer (لتحميل الملفات)",
        "EJS (لعرض المشاهد)",
        "Nodemailer (لإرسال رسائل البريد الإلكتروني المعاملات)",
        "SWA (تطبيقات الويب الثابتة)"
      ]
    },
    "ProjectFour": {
      "Overview": [
        "تم تطوير تطبيق Todo متعدد الاستخدامات لمساعدة المستخدمين على إدارة مهامهم بفعالية.",
        "يتضمن التطبيق وظائف لإضافة وتعديل وحذف المهام، بالإضافة إلى وضع علامة عليها كمكتملة.",
        "تم دمج نظام المصادقة للمستخدمين للسماح لهم بإنشاء حسابات وحفظ مهامهم بأمان.",
        "تنفيذ تحديثات في الوقت الفعلي لضمان أن التغييرات في المهام تنعكس فورًا عبر واجهة المستخدم.",
        "تم تحسينه للاستجابة لضمان تجربة سلسة عبر أجهزة مختلفة."
      ],
      "Features": [
        "إدارة المهام مع خيارات لإضافة وتعديل وحذف المهام ووضع علامة عليها كمكتملة.",
        "نظام مصادقة المستخدمين لإنشاء الحسابات وإدارة المهام.",
        "تحديثات في الوقت الفعلي لعرض التغييرات في المهام على الفور.",
        "تصميم متجاوب لتجربة متسقة عبر أحجام الشاشة المختلفة.",
        "واجهة مستخدم نظيفة وبديهية لإدارة المهام بسهولة."
      ],
      "TechnologiesUsed": [
        "React",
        "Node.js",
        "HTML/CSS",
        "JavaScript",
        "Bootstrap",
        "Material-UI",
        "Axios"
      ]
    }
  },
    "EDUsection": {
      "title": "التعليم والتدريب",
      "firstPart": {
        "title": "بكالوريوس في الهندسة الكهربائية",
        "description": "تخرجت من جامعة التكنولوجيا عام 2017 بدرجة بكالوريوس في الهندسة الكهربائية.",
        "docs": []
      },
      "secondPart": {
        "title": "شهادة في تقنيات الحاسوب"
      }
    },
    "WEsection": {
      "title": "الخبرة العملية",
      "firstPart": {
        "title": "مطور برمجيات",
        "companyName": "CODE MATRIX ZONE",
        "period": "6/12/2022 – حتى الآن روتردام، هولندا",
        "description": "بصفتي مطور برمجيات، أنا مسؤول عن تصميم وتطوير وصيانة التطبيقات البرمجية المصممة لتلبية المتطلبات الخاصة بكل مشروع. أركز على كتابة كود نظيف وفعال وقابل للاختبار مع الالتزام بمعايير الصناعة. بالإضافة إلى التطوير، أضمن أن التطبيقات البرمجية موثوقة وتعمل بأفضل أداء من خلال تصحيح الأخطاء بدقة وحل المشكلات، وتطبيق منهجيات اختبار صارمة لتحديد العيوب وحلها. أتعاون بشكل مكثف مع مديري المشاريع والمصممين والمطورين الآخرين لضمان تكامل سلس ومواءمة مع أهداف المشروع. من خلال التواصل الواضح، أبقي جميع أصحاب المصلحة على اطلاع بالتقدم والتحديات والحلول، لضمان أن المشاريع تبقى على المسار الصحيح وتفي بالمواعيد النهائية. ملتزمًا بالبقاء في طليعة صناعة التكنولوجيا، أوسع باستمرار معرفتي بلغات البرمجة الجديدة والأدوات والتقنيات. أطبق هذه المعارف لتحسين عملياتي التطويرية وتحسين جودة البرمجيات التي أقدمها، مع الالتزام دائمًا بأفضل الممارسات لضمان أن كل حل أقدمه قابل للتطوير ومستدام."
      }
    },
    "WEsection1": {
      "title": "الخبرة العملية كمهندس كهربائي",
      "firstPart": {
        "title": "مهندس كهربائي",
        "companyName": "ARSANMAK MAKINA",
        "period": "05/01/2018 – 01/09/2019 إسطنبول، تركيا",
        "description": "بصفتي مهندس كهرباء في Arsanmak Makina، قمت بتصميم مخططات كهربائية تفصيلية وتخطيطات لآلات التعبئة والتغطية التلقائية باستخدام EPLA. من خلال التعاون الوثيق مع العملاء والمهندسين وأعضاء الفريق، ضمنت تلبية متطلبات المشروع وحل المشكلات التقنية بفعالية. كما قمت بتوثيق تقدم المشاريع، وتحليل البيانات، وإعداد تقارير شاملة حول الدراسات الكهربائية. بالإضافة إلى ذلك، قمت بتطوير مواصفات المعدات لشراء المكونات الكهربائية والمواد، لضمان توافقها مع احتياجات ومعايير المشروع."
      },
      "secondPart": {
        "title": "مهندس كهربائي",
        "companyName": "ALSHEHABIE",
        "period": "15/06/2016 – 01/09/2017 طرطوس، سوريا",
        "description": "بصفتي مهندس كهربائي في Alshehabie، قمت بتصميم مخططات PLC تفصيلية لأنظمة الترحيل والحماية، لضمان التشغيل الآمن والموثوق للأنظمة الكهربائية. قمت بتطوير وإدارة جزء التصميم الكهربائي من جداول مشاريع، وتنسيق المهام لتحقيق المواعيد النهائية ومواءمة الجداول مع خطط المشاريع العامة. من خلال تطبيق أفضل الممارسات الصناعية، ضمنت تصميمات كهربائية مثالية وساهمت في تحسين العمليات بشكل مستمر، مما ساهم في كفاءة وجودة المشاريع."
      }
    }
  
  
}

  