{
  "Welcome": "Hallo",
  "name": "Ik ben Abdulrahman Akhras",
  "position": "Een Fullstack Developer",
  "where": "Uit Nijmegen, NL.",
  "what i do": "Ik maak op maat gemaakte websites om bedrijven online beter te laten presteren.",
  "aboutme1LineOne":"Ik ben een professionele Frontend Developer   ",
  "aboutme1LineTwo":"woonachtig in Nijmegen met twee jaar ervaring ",
  "aboutme1LineThree":"in React en Vue. Ik ben gespecialiseerd in het",
  "aboutme1LineFour":"bouwen van moderne en responsieve applicaties,",
  "aboutme1LineFive":"met focus op gebruiksvriendelijke oplossingen.",
  "aboutme1LineSix":"Ik heb sterke vaardigheden in Agile-methodes   ",
  "aboutme1LineSeven":"en moderne ontwikkelingstools.                ",
  "aboutme2LineOne": "Ik heb ook vier jaar ervaring in elektrotechniek              ",
  "aboutme2LineTwo": "(EPLAN P8) en een Bachelor in elektrotechniek. ",
  "aboutme2LineThree": "Mijn technische achtergrond verbetert ",
  "aboutme2LineFour": "mijn probleemoplossende vaardigheden.",
  "Project": {
    "ProjectOne": {
      "Overview": [
        "Ontwikkeld een interactieve webapplicatie die is ontworpen om de digitale diensten en oplossingen van een bedrijf op een visueel aantrekkelijke manier te presenteren.",
        "De applicatie biedt een naadloze gebruikerservaring met aangepaste navigatie en interactieve elementen, waarbij verschillende zakelijke uitdagingen en hun bijbehorende oplossingen worden gepresenteerd."
      ],
      "Features": [
        "Aangepaste navigatie met vloeiende overgangen en een intuïtieve gebruikersinterface.",
        "Interactieve elementen zoals animaties, hover-effecten en dynamische inhoud.",
        "Oplossingspresentaties die zakelijke uitdagingen en oplossingen duidelijk presenteren."
      ],
      "TechnologiesUsed": [
        "React",
        "TypeScript",
        "React Router",
        "HTML/CSS",
        "Vite",
        "Tailwind CSS",
        "Netlify",
        "Swiper",
        "Framer Motion"
      ]
    },
    "ProjectTwo": {
      "Overview": [
        "Ontwikkeld een uitgebreide webapplicatie voor een brillenretailer, met de focus op het presenteren en beheren van zonnebrilproducten.",
        "De applicatie bevat functies voor het bladeren door producten, het bekijken van gedetailleerde productinformatie en het beheren van een winkelwagentje.",
        "Geïntegreerd met Stripe voor veilige en efficiënte betalingsverwerking, zodat gebruikers hun aankopen soepel kunnen afronden.",
        "Gebruik van een externe API om de locatie van de gebruiker te controleren en te gebruiken voor verbeterde functionaliteit, zoals het weergeven van winkel locaties of lokale promoties.",
        "Implementatie van gebruikersauthenticatie om klanten in staat te stellen accounts aan te maken, in te loggen en hun bestellingen te volgen.",
        "Incorporatie van responsieve ontwerpprincipes om een naadloze gebruikerservaring op verschillende apparaten te waarborgen.",
        "Gebruik van een moderne techstack om een soepele en efficiënte winkelervaring te bieden, inclusief real-time updates en interactieve elementen."
      ],
      "Features": [
        "Productcatalogus met gedetailleerde informatie en hoogwaardige afbeeldingen.",
        "Winkelwagentje functionaliteit met real-time updates en afrekenproces.",
        "Veilige betalingsverwerking geïntegreerd met Stripe.",
        "Externe API-integratie voor het controleren van gebruikerslocatie en het aanbieden van gelokaliseerde diensten.",
        "Gebruikersauthenticatiesysteem voor accountbeheer en ordertracking.",
        "Responsief ontwerp dat zorgt voor compatibiliteit met desktops, tablets en smartphones.",
        "Interactieve elementen om de gebruikersbetrokkenheid en productontdekking te verbeteren."
      ],
      "TechnologiesUsed": [
        "React",
        "Node.js",
        "Express.js",
        "MongoDB",
        "HTML/CSS",
        "JavaScript",
        "Bootstrap",
        "Material-UI",
        "Redux",
        "React Router",
        "Axios",
        "Stripe",
        "Externe API voor locatie services"
      ]
    },
    "ProjectThree": {
      "Overview": [
        "Ontwikkeld een backend-systeem voor gebruikersbeheer en authenticatie, gebruikmakend van moderne technologieën om veilige en efficiënte functionaliteiten te bieden.",
        "Het systeem omvat gebruikersregistratie, e-mailverificatie en veilige inlogmechanismen met JSON Web Tokens (JWT).",
        "Geïntegreerde bestandsuploadcapaciteiten met Multer en dynamische weergave met EJS.",
        "Implementatie van e-mailmeldingen met Nodemailer voor transactionele doeleinden.",
        "Gebruik van SWA (Static Web Apps) voor naadloze bestandspublicatie en hosting.",
        "De applicatie ondersteunt gebruikersprofielbeheer en veilige sessiebehandeling."
      ],
      "Features": [
        "Gebruikersregistratie met e-mailverificatie en veilige authenticatie.",
        "JWT-gebaseerde authenticatie voor veilige en stateless gebruikerssessies.",
        "Bestandsuploadfunctionaliteit met Multer voor het verwerken van door gebruikers gegenereerde inhoud.",
        "Dynamische weergave met EJS voor gepersonaliseerde gebruikerservaringen.",
        "Transactionele e-mailmeldingen via Nodemailer voor acties zoals registratie en verificatie.",
        "Efficiënte bestandspublicatie en hosting met SWA."
      ],
      "TechnologiesUsed": [
        "Node.js",
        "Express.js",
        "MongoDB",
        "JSON Web Tokens (JWT)",
        "Multer (voor bestandsuploads)",
        "EJS (voor weergave van views)",
        "Nodemailer (voor het verzenden van transactionele e-mails)",
        "SWA (Static Web Apps)"
      ]
    },
    "ProjectFour": {
      "Overview": [
        "Ontwikkeld een veelzijdige Todo-applicatie om gebruikers te helpen hun taken effectief te beheren.",
        "De applicatie bevat functionaliteiten voor het toevoegen, bewerken en verwijderen van taken, evenals het markeren als voltooid.",
        "Gebruikersauthenticatie geïntegreerd om gebruikers in staat te stellen accounts aan te maken en hun taken veilig op te slaan.",
        "Implementatie van real-time updates om ervoor te zorgen dat taakwijzigingen onmiddellijk worden weerspiegeld in de gebruikersinterface.",
        "Geoptimaliseerd voor responsiviteit om een naadloze ervaring op verschillende apparaten te garanderen."
      ],
      "Features": [
        "Taakbeheer met opties om taken toe te voegen, bewerken, verwijderen en markeren als voltooid.",
        "Gebruikersauthenticatiesysteem voor accountcreatie en taakbeheer.",
        "Real-time updates om wijzigingen in taken onmiddellijk weer te geven.",
        "Responsief ontwerp voor een consistente ervaring op verschillende schermformaten.",
        "Schone en intuïtieve gebruikersinterface voor gemakkelijke taakbeheer."
      ],
      "TechnologiesUsed": [
        "React",
        "Node.js",
        "HTML/CSS",
        "JavaScript",
        "Bootstrap",
        "Material-UI",
        "Axios"
      ]
    }
  },
    "EDUsection": {
      "title": "OPLEIDING EN TRAINING",
      "firstPart": {
        "title": "BACHELOR IN ELEKTROTECHNIEK",
        "description": "Afgestudeerd aan de Technische Universiteit in 2017 met een bachelordiploma in Elektrotechniek.",
        "docs": []
      },
      "secondPart": {
        "title": "CERTIFICAAT IN COMPUTERTECHNIEKEN"
      }
    },
    "WEsection": {
      "title": "WERKERVARING",
      "firstPart": {
        "title": "SOFTWAREONTWIKKELAAR",
        "companyName": "CODE MATRIX ZONE",
        "period": "6/12/2022 – HUIDIG Rotterdam, Nederland",
        "description": "Als softwareontwikkelaar ben ik verantwoordelijk voor het ontwerpen, ontwikkelen en onderhouden van softwaretoepassingen die zijn afgestemd op de specifieke vereisten van elk project. Ik richt me op het schrijven van schone, efficiënte en testbare code volgens industriestandaarden. Naast ontwikkeling zorg ik ervoor dat softwaretoepassingen betrouwbaar zijn en optimaal presteren door grondig te debuggen en problemen op te lossen, en strenge testmethoden toe te passen om defecten te identificeren en op te lossen. Ik werk intensief samen met projectmanagers, ontwerpers en andere ontwikkelaars om een naadloze integratie en afstemming met de projectdoelen te garanderen. Door duidelijke communicatie houd ik alle belanghebbenden op de hoogte van voortgang, uitdagingen en oplossingen, zodat projecten op schema blijven en deadlines worden gehaald. Toegewijd aan het bijblijven in de tech-industrie, breid ik continu mijn kennis uit over nieuwe programmeertalen, tools en technologieën. Ik pas deze kennis toe om mijn ontwikkelingsprocessen te verfijnen en de kwaliteit van de software die ik lever te verbeteren, waarbij ik altijd de beste praktijken hanteer om ervoor te zorgen dat elke oplossing zowel schaalbaar als duurzaam is."
      }
    },
    "WEsection1": {
      "title": "WERKERVARING ALS ELEKTRO-INGENIEUR",
      "firstPart": {
        "title": "ELEKTRO-INGENIEUR",
        "companyName": "ARSANMAK MAKINA",
        "period": "05/01/2018 – 01/09/2019 Istanbul, Turkije",
        "description": "Als Elektro-ingenieur bij Arsanmak Makina ontwierp ik gedetailleerde elektrische schema's en lay-outs voor automatische vul- en sluitmachines met behulp van EPLA. Door nauw samen te werken met klanten, ingenieurs en teamleden zorgde ik ervoor dat projectvereisten werden nageleefd en technische problemen effectief werden opgelost. Ik documenteerde ook de voortgang van projecten, analyseerde gegevens en stelde uitgebreide rapporten op over elektrische studies. Daarnaast ontwikkelde ik specificaties voor de aanschaf van elektrische componenten en materialen, zodat deze overeenkwamen met projectbehoeften en -normen."
      },
      "secondPart": {
        "title": "ELEKTRO-INGENIEUR",
        "companyName": "ALSHEHABIE",
        "period": "15/06/2016 – 01/09/2017 Tartous, Syrië",
        "description": "Als Elektro-ingenieur bij Alshehabie ontwierp ik gedetailleerde PLC-schema's voor systeemrelais en bescherming, zodat elektrische systemen veilig en betrouwbaar konden werken. Ik ontwikkelde en beheerde het elektrische ontwerpdeel van projectplanningen, coördineerde taken om deadlines te halen en zorgde voor afstemming met de algemene projectplanningen. Door het toepassen van best practices in de branche zorgde ik voor optimale elektrische ontwerpen en stimuleerde ik continue procesverbeteringen, wat bijdroeg aan de efficiëntie en kwaliteit van projecten."
      }
    }
  
  
}

